# CreateFromConnector Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPartRouteEnd..::..CreateFromConnector Method
FabricationPartRouteEnd Class See Also
---
Create fabrication routing end from connector end point.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static FabricationPartRouteEnd CreateFromConnector(
	Connector connnector
)
```

Visual Basic
---
```text
Public Shared Function CreateFromConnector ( _
	connnector As Connector _
) As FabricationPartRouteEnd
```

Visual C++
---
```text
public:
static FabricationPartRouteEnd^ CreateFromConnector(
	Connector^ connnector
)
```

# ### Parameters
connnector
    Type: Autodesk.Revit.DB..::..Connector The connector that the route will connect to. The connector cannot have an existing connection.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Connector is connected. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationPartRouteEnd Class
Autodesk.Revit.DB.Fabrication Namespace